Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: For full Gradle details <<gradle, see below>>.
zh_cn: 关于Gradle的全部细节，link:#gradle[请见下文] 。

source: For instance, having the following properties in your `application.properties`:
zh_cn: 例如，在你的 `application.properties` 中有以下属性：

source: For instance:
zh_cn: 比如：

source: For more details on the format of this file, please refer to https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/Reflection.md[the GraalVM documentation].
zh_cn: 关于该文件格式的更多细节，请参考 https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/Reflection.md[GraalVM文档] 。

source: For more details please refer to the xref:logging.adoc#logging-adapters[Logging guide].
zh_cn: 更多细节请参考 xref:logging.adoc#logging-adapters[日志指南]。

source: For more examples, please consult the xref:mongodb-panache.adoc[Java version] for complete details. Both APIs are the same and work identically except for some Kotlin-specific tweaks to make things feel more natural to Kotlin developers. These tweaks include things like better use of nullability and the lack of `Optional` on API methods.
zh_cn: 关于更多的例子，请参考 link:mongodb-panache.html[Java版本] 以获取完整详细信息。除了一些针对Kotlin的调整以使Kotlin开发者感觉更自然外，两个API都是一样的，工作方式也是一样的。这些调整包括更好地使用nullability和API方法上缺乏 `Optional` 。

source: For more information about GraalVM resource handling in native executables please refer to https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/Resources.md[the GraalVM documentation].
zh_cn: 关于本地可执行文件中GraalVM资源处理的更多信息，请参考 https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/Resources.md[GraalVM文档] 。

source: For more information about OIDC authentication and authorization methods you can use to secure your Quarkus applications, see the following detailed resources:
zh_cn: 关于可以应用于保护Quarkus程序的OIDC认证和授权的更多方式，请看以下更详细的资源：

source: For more information about Proxy Classes you can read https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/DynamicProxy.md[the GraalVM documentation].
zh_cn: 关于代理类的更多信息，你可以阅读 https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/DynamicProxy.md[GraalVM文档] 。

source: For more information about RESTEasy Reactive, please refer to the xref:resteasy-reactive.adoc[dedicated guide].
zh_cn: 有关RESTEasy Reactive的更多信息，请参考 link:resteasy-reactive.html[专用指南] 。

source: For more information about `--initialize-at-run-time`, please read https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/ClassInitialization.md[the GraalVM documentation].
zh_cn: 关于 `--initialize-at-run-time` 的更多信息，请阅读 https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/ClassInitialization.md[GraalVM文档] 。

source: For more information about `Basic` or `Form` HTTP-based authentication, see the following resources:
zh_cn: 关于基于 `Basic` 或 `Form` HTTP的认证的更多信息，请参阅一下资料：

source: For more information about customizing Quarkus Security including reactive security, and how to register a security provider, see xref:security-customization.adoc[Security customization].
zh_cn: 关于定制Quarkus Security包括响应式Security的更多信息，以及如何注册一个安全提供者，请参见 link:security-customization.html[安全定制] 。

source: For more information about the usage of a `QuarkusTestResourceLifecycleManager` please read xref:getting-started-testing.adoc#quarkus-test-resource[Quarkus test resource].
zh_cn: 有关 `QuarkusTestResourceLifecycleManager` 的更多信息，请阅读 link:getting-started-testing.html#quarkus-test-resource[Quarkus测试资源] 。

source: For more information on receiving Cloud Events, see https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.12/amqp/amqp.html#_receiving_cloud_events[Receiving Cloud Events] in SmallRye Reactive Messaging documentation.
zh_cn: 关于接收云事件的更多信息，请参阅SmallRye响应式消息文档中的 link:https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.12/amqp/amqp.html#_receiving_cloud_events[接收云事件] 。

source: For more information on sending Cloud Events, see https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.12/amqp/amqp.html#_sending_cloud_events[Sending Cloud Events] in SmallRye Reactive Messaging documentation.
zh_cn: 关于发送云事件的更多信息，请参阅SmallRye响应式消息文档中的 link:https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.12/amqp/amqp.html#_sending_cloud_events[发送云事件] 。

source: For more information, see the xref:security-openid-connect-client.adoc[OpenID Connect client and token propagation quickstart] and xref:security-openid-connect-client-reference.adoc[OpenID Connect (OIDC) and OAuth2 client and filters reference] guides.
zh_cn: 更多信息请参见《 link:security-openid-connect-client.html[使用OpenID Connect客户端和token传递quickstart] 》和 《 link:security-openid-connect-client-reference.htmlOpenID Connect (OIDC) 和 OAuth2 客户端以及过滤器参考] 》指南。

source: For more information, see xref:security-jwt.adoc[Using SmallRye JWT role-based access control].
zh_cn: 更多信息请参见《 link:security-jwt.html[使用SmallRye JWT RBAC] 》指南。

source: For more options, such as Homebrew or Chocolatey, see <a href="/guides/cli-tooling">the Quarkus CLI guide</a>.
zh_cn: 更多的选项，如Homebrew或Chocolatey，请参见<a href="/guides/cli-tooling">Quarkus CLI指南</a>。

source: For native image, however the URL Connection client must be preferred over the Apache HTTP Client when using synchronous mode, due to issues in the GraalVM compilation (at present).
zh_cn: 然而，对于原生镜像，由于GraalVM编译中的问题（目前），在使用同步模式时，URL Connection客户端必须优先于Apache HTTP客户端。

source: For now `@TestHTTPResource` allows you to inject `URI`, `URL` and `String` representations of the URL.
zh_cn: 目前为止 `@TestHTTPResource` 允许您注入 `URI` 、 `URL` 以及 `String` 的URL表示。

source: For podman:
zh_cn: 对于podman：

source: For questions related to the development of Quarkus:
zh_cn: 对于与Quarkus自身开发相关的问题：

source: For testing, Quarkus starts up a separate Mock Event server under port 8081. The default port for Rest Assured is automatically set to 8081 by Quarkus, so you don't have to worry about setting this up.
zh_cn: 为了测试，Quarkus在端口8081下启动了一个单独的模拟事件服务器。Rest Assured的默认端口被Quarkus自动设置为8081，所以你不必担心设置这个。

source: For the AWS HTTP API you can inject the AWS variables `com.amazonaws.services.lambda.runtime.Context` and `com.amazonaws.services.lambda.runtime.events.APIGatewayV2HTTPEvent`. Here is an example:
zh_cn: 对于AWS HTTP API，你可以注入AWS变量 `com.amazonaws.services.lambda.runtime.Context` 和 `com.amazonaws.services.lambda.runtime.events.APIGatewayV2HTTPEvent` 。下面是一个例子：

source: For the AWS REST API you can inject the AWS variables `com.amazonaws.services.lambda.runtime.Context` and `io.quarkus.amazon.lambda.http.model.AwsProxyRequestContext`. Here is an example:
zh_cn: 对于AWS REST API，你可以注入AWS变量 `com.amazonaws.services.lambda.runtime.Context` 和 `io.quarkus.amazon.lambda.http.model.AwsProxyRequestContext` 。下面是一个例子：

source: For the purposes of these examples I am going to assume we have an endpoint that looks like the following:
zh_cn: 为了演示这些例子的目的，这里将假设我们有一个类似于下面的节点：

source: For the sam template files, add the following to the YAML function Properties.
zh_cn: 对于Sam模板文件，将以下内容添加到YAML函数属性中。

source: For the test class here is an example:
zh_cn: 对于测试类，这里有一个例子：

source: For these operations, you can express the update document the same way you express your queries, here are some examples:
zh_cn: 对于这些操作，你可以用表达查询的同样方式来表达更新文件，这里有一些例子：

source: For this example, we'll use the Prometheus registry.
zh_cn: 在这个例子中，我们将使用Prometheus registry。

source: For this type of application, Quarkus relies on well-known standards such as JAX-RS, JPA and MicroProfile Rest Client, but also Hibernate with Panache to simplify interactions with databases.
zh_cn: 对于这种类型的应用，Quarkus依赖于众所周知的标准，如JAX-RS、JPA和MicroProfile Rest Client，但也有Hibernate与Panache来简化与数据库的交互。

source: For this, you can use an `Emitter`.
zh_cn: 这种情况下您可以使用 `Emitter` 。

source: For this, you need to create a class (a POJO) that will only contain the projected fields. This POJO needs to be annotated with `@ProjectionFor(Entity.class)` where `Entity` is the name of your entity class. The field names, or getters, of the projection class will be used to restrict which properties will be loaded from the database.
zh_cn: 为此，你需要创建一个只包含映射字段的类（一个POJO）。这个POJO需要被注释为 `@ProjectionFor(Entity.class)` ，其中 `Entity` 是你的实体类的名称。映射类的字段名称或 getter 将用于限制将从数据库加载的属性。

source: For usage questions, we recommend to:
zh_cn: 对于使用问题，我们建议到：

source: For using `KafkaCompanion` API in tests, start by adding the following dependency:
zh_cn: 为了在测试中使用 `KafkaCompanion` API，首先要添加以下依赖：

source: For years, the client-server architecture has been the de-facto standard to build applications. But a significant shift happened. The <em>one model rules them all</em> age is over. A new range of applications and architectural styles have emerged and transformed how code is written and how applications are deployed and executed. HTTP microservices, reactive applications, event-driven architecture, and serverless are now central players in modern systems.
zh_cn: 多年来，客户端服务器（CS）架构一直是构建应用程序的事实标准。但是，一个重大的转变发生了。<em>一种模式统治一切</em>的时代已经过去。一系列新的应用程序和架构风格已经出现，并改变了代码的编写方式以及应用程序的部署和执行方式。HTTP微服务、响应式应用、事件驱动架构和无服务器现在是现代系统的核心角色。

source: For your unit tests, you can also invoke on the mock event server using any HTTP client you want. Here's an example using rest-assured. Quarkus starts up a separate Mock Event server under port 8081. The default port for Rest Assured is automatically set to 8081 by Quarkus so you can invoke on this endpoint.
zh_cn: 对于单元测试，你也可以使用任何你想要的HTTP客户端在模拟事件服务器上进行调用。下面是一个使用rest-assured的例子。Quarkus在端口8081上启动了一个单独的模拟事件服务器。Rest Assured的默认端口被Quarkus自动设为8081，所以你可以在这个端点上进行调用。

source: Forced JWK cache refresh interval in minutes which is used to restrict the frequency of the forced refresh attempts which may happen when the token verification fails due to the cache having no JWK key with a `kid` property matching the current token's `kid` header. It will be ignored unless the `mp.jwt.verify.publickey.location` points to the HTTP or HTTPS URL based JWK set.
zh_cn: 强制刷新JWK缓存的时间间隔，以分钟为单位，用于限制强制刷新尝试的频率，这可能发生在令牌验证失败时，因为缓存中没有能与当前令牌带 `kid` 属性的JWK密钥，相匹配的 `kid` header。除非 `mp.jwt.verify.publickey.location` 指向基于HTTP或HTTPS URL的JWK集，否则它将被忽略。

source: Fork the [project repository](https://github.com/quarkusio/quarkusio.github.io), then clone your fork.
zh_cn: 将 [项目 repository](https://github.com/quarkusio/quarkusio.github.io)打分支，然后克隆您的 fork.

source: Found a security vulnerability in Quarkus, its extensions or the dependencies they use? See the <a href="{{site.baseurl}}/security">security policy page</a> to learn to report it.
zh_cn: 在Quarkus、其扩展或其使用的依赖项中发现了安全漏洞？请参阅<a href="{{site.baseurl}}/security">安全策略页面</a>，了解如何报告它。

source: From sequential to continuation style
zh_cn: 从顺序到延续风格

source: From the output above one can see that, in addition to the produced jar file and the associated lib directory, a text file named `native-image.args` was created. This file holds all parameters (including the name of the JAR to compile) to pass along to GraalVM's `native-image` command. If you have GraalVM installed, you can start the native compilation by executing:
zh_cn: 从上面的输出可以看出，除了生成的jar文件和相关的lib目录外，还创建了一个名为 `native-image.args` 的文本文件。这个文件包含了所有的参数（包括要编译的JAR的名字），以及传递给GraalVM的 `native-image` 命令。如果你已经安装了GraalVM，你可以通过执行以下命令开始本地编译：

source: From the outset, Quarkus has been designed around a container-first philosophy. What this means in concrete terms is that Quarkus applications are optimised for low memory usage and fast startup times in the following ways:
zh_cn: 从一开始，Quarkus的设计就围绕着容器优先的理念。这意味着Quarkus应用程序在以下方面进行了优化，以达到低内存使用和快速启动的目的：

source: Fully static native executables support is experimental.
zh_cn: 纯静态原生可执行文件支持是试验性的。

source: Functional tests
zh_cn: 功能测试

source: Further simplification with `@InjectMock`
zh_cn: 使用 `@InjectMock` 进行进一步简化

source: Furthermore, the `ObjectMapper` is configured to format dates and time in ISO-8601 (by disabling the `SerializationFeature.WRITE_DATES_AS_TIMESTAMPS` feature).
zh_cn: 此外， `ObjectMapper` 被配置为ISO-8601的日期和时间格式（通过禁用 `SerializationFeature.WRITE_DATES_AS_TIMESTAMPS` 功能）。

source: Future versions of Quarkus will configure the Kotlin compiler plugin in a way that will make it unnecessary to alter this configuration.
zh_cn: Quarkus的未来版本将以无需更改此配置文件的方式来配置Kotlin编译器插件。

source: Gauges measure a value that can increase or decrease over time, like the speedometer on a car. Gauges can be useful when monitoring the statistics for a cache or collection. Consider the following simple example that observes the size of a list:
zh_cn: Gauges测量的是一个可以随时间增加或减少的数值，就像汽车上的车速表。Gauges在监控一个缓存或集合的统计数据时很有用。考虑下面这个观察列表大小的简单例子：

source: Generate X.509 certificates with Vault’s PKI Secret Engine.
zh_cn: 用Vault的PKI加密引擎生成X.509证书。

source: Generate a new `Command` based on the nodejs code available in https://github.com/vert-x3/vertx-redis-client[`vertx-redis-client`] repository:
zh_cn: 使用 link:https://github.com/vert-x3/vertx-redis-client[`vertx-redis-client`] 仓库中的Nodejs代码，生成一个新的 `Command`。

source: GenerateToken main Driver Class
zh_cn: GenerateToken主驱动类

source: Generating Keys with OpenSSL
zh_cn: 用OpenSSL生成密钥

source: Generating a JWT
zh_cn: 生成一个JWT

source: Generation does not support collections such as `List<Fruit>`. Refer to <<jackson-serialization>> to write your own serializer/deserializer for this case.
zh_cn: 生成机制不支持诸如 `List<Fruit>` 这样的集合。请参考 link:#jackson-serialization[[jackson序列化]] 为这种情况编写您自己的序列化器/反序列化器。

source: Get Started
zh_cn: 开始体验

source: Get answers to some of your common Quarkus questions.
zh_cn: 找到一些常见Quarkus问题的答案。

source: Get early test feedback with Continuous Testing.
zh_cn: 通过持续测试获得早期测试反馈。

source: Get instant feedback on code changes as tests run in the background on impacted code.
zh_cn: 当测试在后台对受影响的代码运行时，获得对代码变化的即时反馈。

source: Get it running
zh_cn: 运行

source: Get new and deeper views into Quarkus from the community through <a href="{{site.baseurl}}/books">these great books</a>.
zh_cn: 通过 <a href="{{site.baseurl}}/books">这些很棒的书</a>，从社区获得对Quarkus新的、更深入的看法。

source: Getting Help from the Community
zh_cn: 从社区获得帮助

source: Getting Started
zh_cn: 入门指南

source: Getting Started With Reactive
zh_cn: 响应式入门

source: Getting Started to SmallRye Reactive Messaging with AMQP 1.0
zh_cn: SmallRye响应式消息与AMQP 1.0入门

source: Getting Started to SmallRye Reactive Messaging with Apache Kafka
zh_cn: 开始使用Apache Kafka的SmallRye响应式消息传递

source: Getting Started with Reactive
zh_cn: 响应式入门

source: Getting Started with gRPC
zh_cn: 开始使用gRPC

source: Getting started with Quarkus Security
zh_cn: 开始使用Quarkus Security

source: Given that, Panache already provides the necessary plumbing to transparently find the appropriate `EntityManager` associated to a Panache entity.
zh_cn: 鉴于此，Panache已经提供了必要的管道， 可以透明地找到Panache实体类对应的 `EntityManager` 。

source: Given the above permission set, `GET /api/foo` would match both permission sets' paths, so would require both the `user` and `admin` roles.
zh_cn: 对于上述权限集， `GET /api/foo` 符合两个权限集的路径，所以需要 `user` 和 `admin` 两个角色。

source: Given the above permission set, `GET /public/foo` would match both permission sets' paths, but because it matches the `permit1` permission set's explicit method, `permit1` will be chosen and the request will be accepted. `PUT /public/foo` on the other hand, will not match the method permissions of `permit1` and so `deny1` will be activated and reject the request.
zh_cn: 对于上述权限集， `GET /public/foo` 将与两个权限集的路径相匹配，但由于它与 `permit1` 权限集的明确方法相匹配， `permit1` 将被选择，请求将被接受。另外， `PUT /public/foo` 没有匹配到 `permit1` 的方法权限，因此 `deny1` 将被激活并拒绝请求。

source: Given the above permission set, `GET /public/foo` would match both the path and method and thus be allowed, whereas `POST /public/foo` would match the path but not the method and would thus be rejected.
zh_cn: 对于上述权限设置， `GET /public/foo` 同时匹配了路径和方法，因此被允许，而 `POST /public/foo` 匹配路径但不匹配方法，因此被拒绝。

source: Given the above permission set, `GET /public/forbidden-folder/foo` would match both permission sets' paths, but because it matches the `deny1` permission set's path on a longer match, `deny1` will be chosen and the request will be rejected.
zh_cn: 对于上述权限集， `GET /public/forbidden-folder/foo` 与两个权限集的路径相匹配，但由于 `deny1` 权限集的路径较长，所以 `deny1` 将被选择，请求将被拒绝。

source: Given this simple entity:
zh_cn: 提供这个简单的实体：

source: Glossary
zh_cn: 词汇表

source: Go ahead and add the new field to the `GreetingProperties` class:
zh_cn: 继续在 `GreetingProperties` 类中添加新的字段:

source: Go more in depth into the Quarkus implementation of CDI.
zh_cn: 更深入地了解Quarkus对CDI的实现。

source: Going further
zh_cn: 进一步探索

source: Gone are the days of a thousand configuration files and formats. A single configuration file is all it takes for Quarkus applications to configure every single extension.
zh_cn: 千篇一律的配置文件和格式的时代已经过去了。Quarkus应用程序只需要一个配置文件就可以配置每一个扩展。

source: Google Cloud Functions with Vert.x Web, Servlet, or RESTEasy
zh_cn: 使用Vert.x Web、Servlet或RESTEasy的Google Cloud Functions

source: GraalVM Native Executable support has been an essential part of the design for Quarkus from the beginning. When an application is compiled down to a native executable, it starts much faster and can run with a much smaller heap than a standard JVM. The native compiler uses aggressive dead-code elimination techniques to only embed the parts of the JVM and classes that are absolutely required by your application. Quarkus makes building optimized native executables plain easy. The build-time approach allows Quarkus to collect enough metadata on your application to fine-tune the compilation. No <code>-H:+ReportUnsupportedElementsAtRuntime</code> flag, no fallback, no compromise!
zh_cn: GraalVM原生可执行文件支持从一开始就是Quarkus设计的重要组成部分。当一个应用程序被编译成一个原生可执行文件时，它的启动速度要快得多，并且可以在比标准JVM小得多的堆中运行。原生编译器使用积极的死代码消除技术，只嵌入JVM的部分和应用程序绝对需要的类。Quarkus使构建优化的原生可执行文件变得非常容易。构建时的方法允许Quarkus在你的应用程序上收集足够的元数据，以便对编译进行微调。没有<code>-H:+ReportUnsupportedElementsAtRuntime</code>标志，没有回退，没有妥协！

source: GraalVM binaries are not (yet) notarized for macOS Catalina as reported in this https://github.com/oracle/graal/issues/1724[GraalVM issue]. This means that you may see the following error when using `gu`:
zh_cn: GraalVM的二进制文件（尚未）对macOS Catalina进行认证，正如这个 https://github.com/oracle/graal/issues/1724[GralVM问题]中所报告的那样。这意味着您在使用 `gu` 时可能会看到以下错误：

source: GraalVM imposes a number of constraints and making your application a native executable might require a few tweaks.
zh_cn: 由于GraalVM的一些限制，在构建生成本地可执行文件的时候，可能需要进行一些调整。

source: GraalVM versions can have different paths for these files, and whether you using the Java 8 or 11 version. Adjust accordingly.
zh_cn: 对于这些文件，GraalVM版本可能有不同的路径，不论你使用的是Java 8还是11版本。请做相应的调整。

source: Gradle (Kotlin DSL)
zh_cn: 或者，如果您使用Gradle Kotlin DSL。

source: Group multiple configuration properties into an object.
zh_cn: 将多个配置属性分组到一个对象中。

source: Grouping properties
zh_cn: 分组属性

source: Guides - Latest
zh_cn: 最新指南

source: HTTP proxy host.
zh_cn: HTTP代理主机。

source: HTTP proxy port.
zh_cn: HTTP代理端口。

source: Handling Deserialization Failures
zh_cn: 反序列化失败的处理

source: Handling Failures
zh_cn: 处理故障

source: Handling Serialization Failures
zh_cn: 处理序列化失败

source: Handling security issues
zh_cn: 处理安全问题

source: Handling streams
zh_cn: 处理流

source: Hang Detection
zh_cn: 挂起侦测

source: Hardcoded values in your code is a no go (even if we all did it at some point ;-)). In this guide, we learn how to configure your application.
zh_cn: 在你的代码中将值硬编码是行不通的（即使我们在某些时候都会这样做;-)）。在本指南中，我们学习如何配置你的应用程序。

source: Have a more in-depth look at how SmallRye Stork can be configured and used.
zh_cn: 更深入地了解如何配置和使用SmallRye Stork。

source: Having `final` classes however does not work well with various frameworks that need to create https://docs.oracle.com/javase/8/docs/technotes/guides/reflection/proxy.html[Dynamic Proxies].
zh_cn: 然而，拥有 `final` 类并不能很好地与需要创建 link:https://docs.oracle.com/javase/8/docs/technotes/guides/reflection/proxy.html[动态代理] 的各种框架配合使用。

source: Having such property groups brings more structure to your configuration. This is especially useful when then number of properties grows.
zh_cn: 这样的属性分组可以为你的配置带来更加丰富的结构。当属性的数量增加时，这尤其有用。

source: Health Checks
zh_cn: 健康检查

source: Health reporting
zh_cn: 健康报告

source: Here `Message` properties class is defined as an inner class, but it could also be a top level class.
zh_cn: 这里 `Message` 属性类被定义为一个内部类，但它也可以作为一个顶层类。

source: Here `text` field is public, but it could also be a private field with getter and setter or just a public getter in an interface. Because `text` does not have a default value it is considered required and unless it is defined in a configuration file (`application.properties` by default) your application will fail to start. Define this property in your `src/main/resources/application.properties` file:
zh_cn: 在这里 `text` 字段是公共的，但它也可以是一个带有getter和setter的私有字段，或者只是一个接口中的公共getter。因为 `text` 没有默认值，所以它被认为是必需的，除非它被定义在一个配置文件中（默认为 `application.properties` ），否则你的应用程序将无法启动。在你的 `src/main/resources/application.properties` 文件中定义该属性:

source: Here are some query examples:
zh_cn: 下面是一些查询例子：

source: Here is an example of the usage of the flush method to allow making a specific action in case of `PersistenceException`:
zh_cn: 下面是一个使用 flush 方法的例子，它在捕获到 `PersistenceException` 异常时执行指定操作：

source: Here is an example of using a `MongoCollection` with the `FruitCodec`.
zh_cn: 这是一个将 `MongoCollection` 与 `FruitCodec` 一起使用的示例。

source: Here there are options, but we've chosen the `lateinit` approach. This allows us to declare these fields as non-null knowing they will be properly assigned either by the constructor (not shown) or by the MongoDB POJO codec loading data from the database.
zh_cn: 这里有一些选项，但我们选择了 `lateinit` 的方法。这允许我们将这些字段声明为非空，因为我们知道它们会被构造函数（未显示）或从数据库加载数据的MongoDB POJO编解码器正确分配。

source: Here we are telling the Spy to return "hi" instead of "hello". When the `GreetingResource` requests the greeting from `GreetingService` we get the mocked response instead of the response of the regular `GreetingService` bean
zh_cn: 这里我们令Spy返回 "hi "而不是 "hello"。当 `GreetingResource` 向 `GreetingService` 请求greeting时，我们得到的是mock的响应，而不是正常的 `GreetingService` Bean的响应

source: Here we build the reply the same way as in the `hello` method but also add a value of the JWT `birthdate` claim by directly calling the injected `JsonWebToken`.
zh_cn: 在这里，我们以与 `hello` 方法相同的方式建立回复，但也通过直接调用注入的 `JsonWebToken` ，添加JWT `birthdate` 要求的值。

source: Here we check if the call is insecure by checking the request user/caller `Principal` against null.
zh_cn: 在这里，我们通过检查请求用户/呼叫者 `Principal` 是否是null值，如果是则不安全。

source: Here we check that the Principal and JsonWebToken have the same name since JsonWebToken does represent the current Principal.
zh_cn: 这里我们检查Principal和JsonWebToken是否有相同的名字，因为JsonWebToken代表了当前的Principal。

source: Here we get the Principal name.
zh_cn: 这里我们得到了Principal的名字。

source: Here we inject `JsonWebToken`
zh_cn: 在这里，我们注入 `JsonWebToken`

source: Here we inject the JAX-RS SecurityContext to inspect the security state of the call and use a `getResponseString()` function to populate a response string.
zh_cn: 这里我们注入JAX-RS SecurityContext来检查调用的安全状态，并使用 `getResponseString()` 函数来得到响应字符串。

source: Here we inject the JsonWebToken interface, an extension of the java.security.Principal interface that provides access to the claims associated with the current authenticated token.
zh_cn: 这里我们注入JsonWebToken接口，这是java.security.Principal接口的扩展，提供了对与当前认证令牌authenticated token相关声明的访问。

source: Here we inject the JsonWebToken.
zh_cn: 这里我们注入JsonWebToken。

source: Here we inject the `birthday` claim as `String` - this is why the `@RequestScoped` scope is now required.
zh_cn: 在这里，我们把 `birthday` 的声明(claim)作为 `String` 注入 - 这就是为什么现在需要 `@RequestScoped` 范围。

source: Here we use `var` but note that `val` can also be used.
zh_cn: 这里我们使用 `var` ，但注意也可以使用 `val` 。

source: Here we use the injected `birthday` claim to build the final reply.
zh_cn: 在这里，我们使用注入的 `birthday` 声明(claim)来建立最终的回复。

source: Here you can find a list of Build Items and the extension that provides them:
zh_cn: 在这里，您可以找到构建项目的列表以及提供它们的扩展：
